#!/usr/bin/env python3


#====================================================================================
# Назначение: Скрипт для детального сравнения двух JSON-файлов и редактирования JSON.
# Автор: Hypnodancer
# Дата создания: 30-12-2025
# Версия: 1.1
#====================================================================================

#------------------------------------------------------------------------------------
# Применение
#------------------------------------------------------------------------------------
#
# Есть два назначения для скрипта
# 1) init_json_diff.py <первый файл.JSON> <второй файл.json> -- разобрать JSON на структуру из папок и файлов (поля JSON)
# 2) make_json.py <1 или 2> -- нахожусь в папке с проектом и собираю файл JSON (после исправлений) - новый файл JSON будет создан в папке NEW/<1 или 2>/
#
#------------------------------------------------------------------------------------


import sys
import json

# Получаю аргументы скрипта
args = sys.argv[1:]
if len(args) != 2:
    sys.exit("В команду нужно передать два аргумента!!!\nАварийное завершение программы")

one, two = args

try:
    with open() as file:
        data = json.load(file)                # передаем файловый объект
        for key, value in data.items():
            if type(value) == list:
                print(f'{key}: {", ".join(value)}')
            else:
                print(f'{key}: {value}')
