#!/usr/bin/env python3


#====================================================================================
#                              Проект: Analizer_JSON
#====================================================================================
#                                2)  make_json.py
#====================================================================================
# Назначение: Скрипт для сборки JSON.
# Автор: Hypnodancer
# Дата создания: 02-01-2026
# Версия: 1.3
#====================================================================================

#------------------------------------------------------------------------------------
#                                   Применение
#------------------------------------------------------------------------------------
#
# Собрать новый исправленный JSON (для первого или второго файла)
#
#    make_json.py <1 или 2> <папка с проектом>
#
#------------------------------------------------------------------------------------


# diff -u <(diff -u 1.json 2.json | sed 1,2d) <(sed 1,2d diff.txt)


import sys
# import json
# import os
from pathlib import Path
# from datetime import datetime
# import subprocess



def make_json():
    """Функция для сборки нового JSON-файла после редактирования
    отдельных полей"""
    pass


def is_change (bool)
Если diff изменился



def make_json(old_pwd):

    if "__0" есть :
        return []
    elif "*key" есть:
        return {if}













if __name__ == '__main__':
    # Получаю аргументы скрипта
    args = sys.argv[1:]
    if len(args) != 2:
        sys.exit("В команду нужно передать два аргумента!!!\nАварийное завершение программы")
    name_json, dir_project = args


    if name_json not in ("1", "2"):
        sys.exit("Вы должны указать номер варианта для сборки!!!\n"
        "Валидные значения: 1 или 2\n"
        "Синтаксис команды должен быть таким:\n"
        "make_json.py <1 или 2> <папка с проектом>")


    if not Path(dir_project).is_dir():
        sys.exit("Вы указали несуществующую папку для проекта!!!")


    # Перехожу в папку с проектом
    
    # узнаю тип JSOn - dict или list

    Создаю словарь или список 

функция возвращает словарь или список
- Получает путь (текщую директорию)
{генератор словаря} или [генератор списка]  -- наверху генератор-функция
